export default {
  "#UI_HOME": "Главная",
  "#UI_LIBRARY": "Библиотека",
  "#UI_CUSTOMIZATION": "Кастомизация",
  "#UI_SETTINGS": "Настройки",
  "#UI_MENU_BACKGROUNDS": "Фоны меню",
  "#UI_CROSSHAIR_SETTINGS": "Настройки прицела",
  "#UI_HUD_SETTINGS": "Настройки HUD'a",
  "#UI_SKYBOXES": "Скайбоксы",
  "#UI_MODELS": "Модели",
  "#UI_QUICK_START": "Быстрый запуск",
  "#UI_STEAM_FRIENDS": "Друзья в стиме",
  "#UI_SEND_MESSAGE": "Отправить сообщение",
  "#UI_NO_FRIENDS": "Не найдено онлайн друзей в стиме",
  "#UI_IN_LAUNCHER": "В %0%",
  "#UI_IN_HL": "Играет в Half-Life",
  "#UI_ONLINE": "В сети",
  "#UI_OFFLINE": "Не в сети",
  "#UI_PLAY": "Играть",
  "#UI_INSTALL": "Установить",
  "#UI_OVERVIEW": "Новости игры",
  "#UI_CONFIGURATOR": "Параметры",
  "#UI_WIKI": "SourceRuns Вики",
  "#UI_GAME_VERSION": "Выбор версии",
  "#UI_EDITED_DLL": "Изменённый WON DLL (НЕ для спидранов)",
  "#UI_EXTERNAL_TOOLS": "Дополнительные настройки",
  "#UI_START_ARGS": "Параметры запуска",
  "#UI_INTERFACE_SETTINGS": "Настройки интерфейса",
  "#UI_INTERFACE_LANGUAGE": "Язык интерфейса",
  "#UI_INTERFACE_THEME": "Оформление",
  "#UI_MISC_SETTINGS": "Прочие настройки",
  "#UI_DISCORD_RPC_SETTINGS": "Discord RPC статус",
  "#UI_EXPERIMENTAL_MODE_SETTINGS": "Экспериментальный режим",
  "#UI_ENGLISH": "Английский",
  "#UI_RUSSIAN": "Русский",
  "#UI_BLUE_THEME": "Синие цвета",
  "#UI_RED_THEME": "Красные цвета",
  "#UI_SNOW_THEME": "Снежная тема",
  "#UI_LANCER_THEME": "Тема Фрилансера",
  "#UI_STEAM_ERROR": "Невозможно подключиться к сети Steam",
  "#UI_GAME_INSTALL": "Установка игры",
  "#UI_INSTALLATION": "Установка %0%",
  "#UI_SPACE_REQUIRED": "Места необходимо: ",
  "#UI_NEXT": "Дальше",
  "#UI_INSTALL_SETTINGS": "Подтверждение",
  "#UI_INSTALL_STATUS": "Статус",
  "#UI_INSTALL_FINISH": "Завершение",
  "#UI_PROGRESS": "Прогресс: ",
  "#UI_DOWNLOADING": "Скачивание...",
  "#UI_EXTRACTING": "Распаковка...",
  "#UI_NOTIFICATION_INSTALLED": "Игра %0% была установлена!",
  "#UI_WON": "WON издание",
  "#UI_STEAM": "Steam издание",
  "#UI_RETRY": "Переподключиться",
  "#UI_DONE": "Готово",
  "#UI_CONFIGS": "Конфигурации",
  "#UI_CONFIGS_CONSTRUCTOR": "Конструктор",
  "#UI_CONFIGS_ADVANCED": "Редактор",
  "#UI_SCRIPT_SETTINGS": "Настройки скрипта %0%",
  "#UI_SCRIPT_SCRIPTLESS": "Scriptless категория",
  "#UI_SCRIPT_SCRIPTED": "Scripted категория",
  "#UI_SCRIPT_BINDS": "Бинды",
  "#UI_SCRIPT_GENERATE": "Установить",
  "#UI_SCRIPT_SAVE": "Сохранить в файл",
  "#UI_SCRIPT_KEY": "Кнопка",
  "#UI_SCRIPT_COMMAND": "Команда",
  "#UI_UNINSTALL": "Удалить",
  "#UI_EDITOR_OPEN": "Открыть файл",
  "#UI_EDITOR_SAVE": "Сохранить файл",
  "#UI_EDITOR_HINTS": "Показать подсказки",
  "#UI_SOUNDCLOUD": "SoundCloud Виджет",
  "#UI_UPDATE_DOWNLOADING": "Загрузка обновления...",
  "#UI_UPDATE_READY": "Требуется перезапуск",
  "#UI_RECENTGAME_NOGAME": "Нет игры",
  "#UI_IN_OTHER_GAME": "В другой игре",
  "#UI_NO_INTERNET": "Нет подключения к Интернету",
  "#UI_SCRIPT_UPDATE": "Обновить базу скриптов",
  "#UI_CHANGELOG": "Что нового?",
  "#UI_GAME_FOLDER": "Открыть папку с игрой",
  "#UI_GRADIENT_THEME": "Градиент",
  "#UI_GOLDSRC": "Игры движка GoldSrc",
  "#UI_GAME_ALLCORES": "Использовать все ядра CPU",
  "#UI_GAME_PRIORITY": "Приоритет процесса",
  "#UI_GAME_PRIORITY_NORMAL": "Нормальный",
  "#UI_GAME_PRIORITY_ABOVENORMAL": "Выше среднего",
  "#UI_GAME_PRIORITY_HIGH": "Высокий",
  "#UI_GAME_PRIORITY_REALTIME": "Реального времени",
  "#UI_GAME_PRIORITY_1C": "1 ядро",
  "#UI_GAME_PRIORITY_2C": "2 ядра",
  "#UI_GAME_PRIORITY_3C": "3 ядра",
  "#UI_GAME_PRIORITY_4C": "4 ядра",
  "#UI_SOUNDCLOUD_SETTINGS": "Настройки SoundCloud",
  "#UI_SOUNDCLOUD_SETTINGS_DESC":
    "Здесь вы можете указать ссылку на трек или плейлист SoundCloud, чтобы сделать его основным в HLSR (только открытые треки или плейлисты)",
  "#UI_SOUNDCLOUD_PLAYLIST": "Ссылка на SoundCloud",
  "#UI_CUSTOMIZATION_BUTTON_SAVE": "Сохранить",
  "#UI_CUSTOMIZATION_BUTTON_RESET": "Сбросить",
  "#UI_CUSTOMIZATION_MENU_BACKGROUNDS": "Фоны меню",
  "#UI_CUSTOMIZATION_SKYBOXES": "Скайбоксы",
  "#UI_CUSTOMIZATION_SCOPE_SETTINGS": "Прицелы",
  "#UI_CUSTOMIZATION_HUD_SETTINGS": "HUD",
  "#UI_CUSTOMIZATION_LQ": "Стандартная версия",
  "#UI_CUSTOMIZATION_HD": "HD вариант",
  "#UI_NO_TRACKS": "Обновление треков",
  "#UI_NO_TAG": "Нет тега",
  "#UI_CUSTOMIZATION_HUGE": "Увеличенная версия",
  "#UI_CUSTOMIZATION_SPRITES": "Спрайты",
  "#UI_CUSTOMIZATION_Q3": "Q3 версия",
  "#UI_NOTIFICATION_SAVED": "Сохранено!",
  "#UI_NOTIFICATION_INSTALLED": "Установлено!",
  "#UI_NOTIFICATION_DONE": "Готово!",
  "#UI_NOTIFICATION_REMOVED": "Удалено!",
  "#UI_NO_PARTICLES": "Отключить частицы",
  "#UI_CANCEL": "Отменить",
  "#UI_ABOUT_PROGRAM": "О программе",
  "#UI_IN_GAME": "В игре",
  "#UI_STARTED": "Запущено",
  "#UI_SPENT_TIME": "%0% ч.",
  "#RPC_MLP": "Готовится к дружбе",
  "#RPC_PLAYING": "Играет в %0%",
  "#RPC_DETAILS": "Подготавливается к спидрану",
  "#RPC_NOSTEAM": "Не подключён",
  "#RPC_MUSIC": "Прослушивает треки",
  "#RPC_WEBSITE": "Вебсайт",
  "#RPC_GET_FRIENDS": "Завести друзей",
  "#MLP_URL": "https://www.youtube.com/channel/UCWaCaCyWgPk6uwKh66fl_0A",
  "#UI_HL1MOVEMENT": "Мод на движения из HL1",
  "#UI_COMPACT_MODE": "Компактный режим",
  "#UI_WELCOME_BACK": "Добро пожаловать назад!",
  "#UI_WELCOME_HLSR": "Добро пожаловать в HLSR!",
  "#RESTART_APP": "Перезапустите HLSR, чтобы применить настроки!",
  "#NEW_UPDATE_INSTALLED": "Новое обновление успешно установлено!",
  "#FOLDER_NOT_EMPTY": "Выбранная папка не пуста!",
  "#SELECT_LIBRARY_FOLDER": "Выберите папку для хранения игр",
  "#INSTALLATION_CANCELED": "Установка была отменена",
  "#INSTALLATION_CYRILLIC": "Символы кириллицы в пути запрещены!",
  "#PATH_NOT_EXISTS": "Выбранный путь недоступен!",
  "#ERROR_NO_WRITE_PERMISSIONS": "У HLSR нет прав на запись в выбранной папке!",
  "#UI_SPACE_REQUIRED_AFTER": "Требуемое место после установки: ",
  "#UI_SPACE_REQUIRED_TO": "Требуемое место для установки: ",
  "#UI_FREE_SPACE": "Свободно на диске: ",
  "#UI_INSTALLING_GAME": "Установка игры — ",
  "#UI_HLSR_LIB_WILL_BE_PLACED": "Библиотека HLSR будет находиться тут:",
  "#UI_DOWNLOADABLE_CONTENT": "В загруженном пакете будет:",
  "#UI_LIVESPLIT": "LiveSplit со сплитами",
  "#UNABLE_TO_DOWNLOAD": "Не удалось установить %0% из-за сетевой ошибки!",
  "#UI_STEAM_RECONNECT": "Переподключиться к Steam",
  "#UI_MAKE_SHORTCUT": "Создать ярлык",
  "#CANT_START_GAME_NOSTEAM": "HLSR не может запустить игру без связи со Steam",
  "#WAITING_FOR_STEAM": "Ожидание подключения Steam для запуска игры...",
  "#REMOVE_GAMES_TO_CHANGE":
    "Путь можно изменить только когда в лаунчере не установлена ни одна игра",
  "#SHORTCUT_LAUNCH": "Запустить",
  "#UI_FOUND_CYRILLIC":
    "По пути к игре найдена кириллица. Работа не гарантируется",
  "#UI_FOUND_CYRILLIC_HINT":
    "Рекоммендуется переустановить игру по другому пути",
  "#UI_ACRYLLIC_THEME": "Акрилловый фон",
  "#UI_BLOBS_THEME": "Анимированный фон",
  "#UI_NO_LICENSE": "Не найдена лицензия игры в Steam",
  "#UI_NO_STEAM": "Запустите Steam",
  "#UI_LIVESPLIT_SPLITS": "LiveSplit сплиты",
  "#UI_LIVESPLIT_SELECT_FILE": "Сменить сплиты",
  "#UI_LIVESPLIT_UPDATE": "Обновить",
  "#UI_LIVESPLIT_REALTIME": "Реальное время",
  "#UI_LIVESPLIT_GAMETIME": "Игровое время",
  "#UI_LIVESPLIT_LOADING": "Загрузка...",
  "#UI_LIVESPLIT_ERROR": "Не удалось открыть файл сплитов",
  "#UI_SEGMENT_NAME": "Сегмент",
  "#UI_TIME": "Время",
  "#UI_BEST_SEGMENT": "Лучший Сегмент",
  "#UI_LEADERBOARD": "Таблица лидеров",
  "#UI_MANAGEMENT": "Управление",
  "#UI_WEBSITE": "Сайт",
  "#UI_CHANGELOG_CONTENT": `<h4>Обновление от 05.08.2022 [v. 0.2.7]</h4>
<ul>
<li>Стандартный плейлист SoundCloud заменён на https://soundcloud.com/nicklas-hee-zhi-en-moe/sets/gaming-music</li>
<li>Исправлено отображение обложек у треков без них</li>
<li>Файлы HL, HLBS и HLOF перенесены на GitHub</li>
<li>Переход на новый домен: hlsr.tk</li>
<li>Обновлены иконки на экране настроек</li>
<li>Добавлена кнопка перехода на сайт</li>
</ul><br/>
<h4>Обновление от 18.05.2022 [v. 0.2.6]</h4>
<ul>
<li>Обновлён интерфейс экрана настроек игры</li>
<li>Добавлена возможность смены сплитов</li>
<li>Добавлена возможность предпросмотра сплитов в лаунчере</li>
<li>Добавлена возможность отмены загрузки игры</li>
<li>Добавлена кнопка открытия таблицы лидеров на speedrun.com</li>
<li>Добавлён счётчик текущей скорости загрузки</li>
<li>Исправлен графический баг чекбоксов, связанный с обновлением Electron</li>
<li>Исправлен баг, при котором Ghosting открывался без стима с главного экрана</li>
<li>Исправлен баг с "прыгающим" прогресс-баром</li>
<li>Оптимизирована работа списка друзей Steam</li>
<li>Переработан модуль менджера загрузок</li>
<li>Произведён рефакторинг и оптимизация некоторых частей кода</li>
</ul><br/>
<h4>Обновление от 15.05.2022 [v. 0.2.5]</h4>
<ul>
<li>Обновлена сборка Half-Life 2: Ghosting</li>
<li>Теперь проверка обновлений просходит только при запуске лаунчера</li>
<li>Теперь для запуска Ghosting необходим запущенный стим</li>
<li>Обновлено окно "О программе"</li>
<h3 style="margin:6px 0;">Half-Life 2: Ghosting</h3>
<li>Установите это обновление, если у вас есть проблемы с Save Deletion</li>
<li>Для установки обновления необходимо переустановить игру</li>
<li>Удалён эмулятор revEmu</li>
</ul><br/>
<h4>Обновление от 14.05.2022 [v. 0.2.4]</h4>
<ul>
<li>Обновлена сборка Half-Life 2: Ghosting</li>
<li>Исправлена ошибка локализации на экране настроек</li>
<li>Добавлены теги в конструкторе скриптов</li>
<li>Добавлено аватар по умолчанию для друзей в стиме</li>
<li>Исправлен баг, при котором время нахождения в игре не учитывалось после удаления RInput или LiveSplit</li>
<li>Обновлён Electron до версии 18.2.0</li>
<h3 style="margin:6px 0;">Half-Life 2: Ghosting</h3>
<li>Для установки обновления необходимо переустановить игру</li>
<li>Размер загружаемого архива уменьшен в 1.5 раза</li>
<li>SmartSteamEmu заменён на RevEmu</li>
<li>Распакованы все VPK файлы и удалены неиспользуемые</li>
</ul><br/>
<h4>Обновление от 06.05.2022 [v. 0.2.3]</h4>
<ul>
<li>Исправлен баг, из-за которого не удалялись скачанные файлы кэша</li>
<li>Поддержка установки игр из разделённых архивов</li>
<li>Добавлена иконка настроек для настраиваемых скриптов</li>
<li>Удалена старая боковая панель</li>
<li>В качестве библиотеки теперь можно выбрать не пустую папку</li>
<li>Ghosting Mod перенесён на сервер GitHub</li>
<li>Убраны ненужные пункты из конфигураторов игр</li>
<li>Переработан загрузчик файлов</li>
<li>Обновлён интерфейс под-меню боковой панели</li>
<li>Небольшие изменения в интерфейсе редактора скриптов</li>
<li>Использование модуля axios вместо electron-dl</li>
<li>Использование 7Z вместо Onezip</li>
<li>Удалены неиспользуемые модули</li>
</ul><br/>
<h4>Обновление от 14.06.2021 [v. 0.2.2]</h4>
<ul>
<li>Добавлена проверка наличия Half-Life 2 в Steam</li>
<li>Исправлен баг с проверкой свободного места на некоторых ОС</li>
<li>Исправлен баг с кнопкой параметров быстрого старта, когда при отсутствии игры кнопка работала</li>
<li>Данные в редакторе скриптов теперь сохраняются при переходах</li>
<li>Добавлены предупреждения о том, что в Steam нет лицензии игры</li>
<li>Новая тема лаунчера, работающая на GLSL шейдерах (может работать не везде)</li>
<li>Модуль Steamworks заменён на HLSR Native</li>
<li>Улучшена проверка лицензий игр в Steam</li>
<li>Друзья Steam теперь будут отображены вне зависимости от наличия лицензии какой-либо игры</li>
<li>Теперь HLSR не отображается в Steam как Half-Life 1</li>
<h3 style="margin:6px 0;">Режим разработчика</h3>
<li>Разбиение кода по файлам</li>
<li>Удалена поддержка расширения HLSRC</li>
<li>Добавлена поддержка расширения HLSD</li>
<li>Просмотрщик HLSD файлов</li>
<li>HLSD файл может хранить в себе медиа файлы (аудио, изображения, видео), а также скрипты в виде HLSC данных</li>
</ul><br/>
<h4>Обновление от 12.05.2021 [v. 0.2.1]</h4>
<ul>
<li>Теперь на экране может быть отображено более одного оповещения</li>
<li>Оповещение может быть закрыто кликом</li>
<li>Эффект волны больше не появляется при нажатии на нерабочую кнопку</li>
<li>Новое оформление установщика игр</li>
<li>Выбор пути установки игр (доступен только когда нет установленных игр)</li>
<li>Теперь HLSR проверяет наличие свободного места на диске перед установкой игр</li>
<li>Загрузка игры больше не должна застревать на одном месте при ошибке сети</li>
<li>HLSR всегда будет запускаться от админа для корректной работы с файлами</li>
<li>Компактный режим теперь по стандарту включён</li>
<li>Добавлена возможность создавать ярлыки к играм на рабочем столе</li>
<li>Исправлен баг, когда страница игры не открывалась без подключения к сети</li>
<li>Индикатор обновления перемещён в область рамки окна</li>
<li>Добавлено предупреждение о символах кириллицы в пути к игре</li>
<li>Оповещение о невозможности подключения к Steam теперь скрыто в компактном режиме, а также вне домашней вкладки обычного режим</li>
<li>Индикатор подключения к Steam в компактном режиме теперь служит кнопкой для переподключения</li>
</ul><br/>
<h4>Обновление от 04.05.2021 [v. 0.2.0]</h4>
<ul>
<li>Новый загрузочный экран</li>
<li>Приветственное сообщение на главном экране</li>
<li>Отныне невозможно запустить два экземпляра программы одновременно</li>
<li>После установки нового обновления ченжлог будет открываться сам</li>
<li>Экран кастомизаций теперь более информативный</li>
<li>Пофикшена установка Half-Life 2: Ghosting</li>
<li>Открываемая папка игры Ghosting мода теперь зависит от того, включён ли HL1 Movement</li>
<li>Обновлён раздел "О программе"</li>
<li>Фикс бага редактора конфигов, когда он выплывал за экран</li>
<li>Исправлена работа подсказок и подсвечивания текста в редакторе кода</li>
<li>Исправлено отображение Ghosting мода в панеле быстрого запуска</li>
</ul><br/>
<h4>Обновление от 03.05.2021 [v. 0.1.9]</h4>
<ul>
<li>Компактный режим</li>
<li>Компактный режим невозможно отключить на экранах с низким разрешением</li>
<li>Half-Life 2: Ghosting Mod (HL1 Movement, Cutsceneless Mod)</li>
<li>Небольшое обновление интерфейса главного экрана</li>
<li>Обновление интерфейса виджета SoundCloud</li>
<li>Добавлены эффекты нажатия на кнопки</li>
<li>Оптимизация кода управления играми</li>
<li>Страница игры в лаунчере теперь покрывает и рамку</li>
<li>фикс бага с отображением настроек кастомизации</li>
<li>Фикс багов локализации</li>
<li>Новый тип оповещений</li>
<li>Удалена снежная тема</li>
</ul><br/>
<h4>Обновление от 14.01.2021 [v. 0.1.8]</h4>
<ul>
<li>Теперь ты можешь увидеть сколько часов провёл в одной из игр</li>
<li>Discord RPC статус изменяется при входе в игру</li>
<li>Друзья в стиме, использующие HLSR, могут видеть игру, в которой ты</li>
<li>Теперь нельзя запустить игру дважды за раз</li>
<li>Оффлайн друзья Steam отныне скрыты</li>
<li>Поддержка кнопок Discord RPC</li>
</ul><br/>
<h4>Обновление от 13.01.2021 [v. 0.1.7]</h4>
<ul>
<li>Фикс кнопки быстрого запуска с настройкой приоритета процесса</li>
<li>Теперь ты можешь увидеть, если твой друг из Steam использует HLSR</li>
<li>Исправлен визуальный баг с чёрной тенью у экрана игры</li>
<li>Только один экземпляр лаунчера может быть запущен в одно время</li>
<li>Размер окна теперь восстанавливается после смены разрешения на очень низкое и обратно</li>
<li>Фикс запуска RInput и BunnymodXT</li>
<li>Исправлен баг, когда при закрытии лаунчера во время обновления появлялась ошибка</li>
<li>Базовая поддержка HLSRC</li>
<li>Улучшение производительности - изменения в алгоритме получения списка друзей Steam</li>
<li>Две версии снежной темы (в зависимости от системного времени)</li>
<li>Добавлены обложки по умолчанию для SoundCloud треков без них</li>
<h3 style="margin:6px 0;">Режим разработчика</h3>
<li>Кнопка переключения инструментов разработчика</li>
<li>Кнопка проверки загруженного HLSRC</li>
</ul><br/>
<h4>Обновление от 02.01.2021 [v. 0.1.5; v. 0.1.6]</h4>
<ul>
<li>Фикс загрузки Half-Life 2</li>
<li>Улучшенная перемотка треков SoundCloud</li>
<li>Возможность установить свой трек или плейлист в SoundCloud виджет</li>
<li>Фикс бага с удалением Half-Life</li>
<li>Фикс бага с установкой Half-Life 2 (была невозможна без установленной HL1)</li>
</ul><br/>
<h4>Обновление от 31.12.2020 [v. 0.1.4]</h4>
<ul>
<li>Начало открытой беты</li>
<li>Half-Life 2</li>
<li>Вкладка кастомизаций</li>
<li>Возможность указать количество ядер для процесса и его приоритет</li>
<li>Снегопад (можно отключить в настройках)</li>
<li>Возможность сбросить базу данных скриптов (нужно при выходе обновления с новыми скриптами)</li>
<li>Теперь можно открыть папку игры прямо из лаунчера</li>
<li>Новые темы оформления</li>
<li>Теперь без темы Фрилансера (она все ещё есть, кто знает...)</li>
<li>Обновление SteamWorks модуля (прирост в производительности)</li>
<li>Фикс кнопки сохранения скрипта в редакторе конфига</li>
<li>Обновления UI интерфейса</li>
<li>Секция "О программе"</li>
<li>Улучшения SoundCloud</li>
<li>Мини оповещения о работе программы</li>
</ul><br/>
<h4>Обновление от 15.08.2020 [v. 0.1.3]</h4>
<ul>
<li>Steam интеграции теперь работают в разы быстрее за счёт использования нативного модуля</li>
<li>Более подробная информация о друзьях в стиме</li>
<li>Кнопка обновления базы данных скриптов в конструкторе</li>
<li>Обновления кода, связанные с оптимизацией работы программы</li>
<li>Возможность перемотки музыки в SoundCloud виджете</li>
<li>Фикс отображения некоторых компонентов при отсутствии Интернета</li>
<li>Появление ченджлога</li>
</ul>
`,
  "#UI_ABOUT_TITLE": `<span style="color:var(--accent-color);font-weight:bold;font-size:18px">HLSR [v. ${
    require("../../../../package.json").version
  }]</span>`,
  "#UI_ABOUT_CONTENT": `Разработчики: <span style="color:#ff492c">InfiniteC0re#7307</span><br/>
Скрипты: <span style="color:#97d4ff">N4Rk0t1k#0302</span>, <span style="color:#c3a4ff">Parklez</span><br/>
Помощь в UI дизайне: <span style="color:#ac6cff">Дизайнер [bmd.GG]#9384</span><br/>
Поддержка проекта: <span style="color:#b7ffaa">ALLAN#0012</span><br/><br/>
В лаунчере использовано:
<ul>
<li>GoldSrc Package 2.3</li>
<li>Bunnymod XT</li>
<li>LiveSplit</li>
<li>Source Unpack</li>
<li>Source Pause Tool</li>
<li>Ghosting Mod</li>
<li>Cutsceneless Mod</li>
<li>HL1 Movement Mod</li>
<li>RInput</li>
</ul>
`,
};
